

//Acwing.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。


#include <iostream>

using namespace std;


//const int N = 100010;

// 单调栈存数字，单调队列存下标

/*1.全局数组没有初始化时, 默认值都是0*/
/*2.局部数组未初始化时,默认值为随机不确定的值*/
/*3.局部数组初始化一部分时,未初始化的部分默认值为0*/
//int q[N], a[N];

/**************************************************************/

//int main()
//{
//	int n = 8, k = 3;
//
//	int a[8] = {1, 3, -1, -3, 5, 3, 6, 7};
//
//	int h = 0, t = -1;
//	//这个for循环是为了输出窗口中的最小值
//	for (int i = 0; i < n; i++)
//	{
//		//如果队头在窗口外面，队头元素出队，也就是队头指针向后移动一位
//		if (h <= t && i - k + 1 > q[h]) h++;
//		//如果队尾元素比当前的元素大，先将队尾元素出队，也就是队尾指针向前移动一位
//		while (h <= t && a[q[t]] >= a[i]) t--;
//		//将小于当前元素的队尾元素移除之后,将当前的下标为i的元素插入队列
//		q[ ++ t] = i;
//		if (i >= k - 1) cout << a[q[h]] << ' ' <<endl;
//
//		for (int j = h; j < t + 1; j++) cout << "********" << q[h] << "********" << endl;
//		 
//	}
//
//	
//	cout << endl;
//
//}

/**************************************************************/